app/controllers/api/v1/beacons_controller.rb

SELECT "beacons".* FROM "beacons"
---
  def index
    @beacons = Beacon.all

SELECT "beacons".* FROM "beacons" WHERE "beacons"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @beacon = Beacon.find(params[:id])

SELECT "museums".* FROM "museums" WHERE "museums"."uuid" = 'B9407F30-F5F8-466E-AFF9-25556B57FE6D' ORDER BY "museums"."id" ASC LIMIT 1
SELECT "regions".* FROM "regions" WHERE "regions"."museum_id" = $1 AND "regions"."major" = '1' ORDER BY "regions"."id" ASC LIMIT 1  [["museum_id", 1]]
SELECT "arts".* FROM "arts" WHERE "arts"."region_id" = $1 AND "arts"."minor" = '1' ORDER BY "arts"."id" ASC LIMIT 1  [["region_id", 1]]
---
  def search
    uuid = params["uuid"]
    major = params["major"]
    minor = params["minor"]

    museum = Museum.where("lower(uuid) = ?", uuid.downcase).first

    error = false

    if !museum.nil?
      region = museum.regions.where(major: major).first

      if !region.nil?
        art = region.arts.where(minor: minor).first