app/controllers/beacons_controller.rb

  def index
    @beacons = Beacon.all
---
SELECT "beacons".* FROM "beacons"

  def create
    @beacon = Beacon.new(beacon_params)

    respond_to do |format|
      if @beacon.save
---
INSERT INTO "beacons" ("created_at", "major", "minor", "updated_at", "uuid") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Fri, 16 May 2014 12:02:53 BRT -03:00], ["major", 1], ["minor", 1], ["updated_at", Fri, 16 May 2014 12:02:53 BRT -03:00], ["uuid", "B9407F30-F5F8-466E-AFF9-25556B57FE6D"]]

    def set_beacon
      @beacon = Beacon.find(params[:id])
---
SELECT "beacons".* FROM "beacons" WHERE "beacons"."id" = $1 LIMIT 1  [["id", "1"]]